{
  "title": "Roulette en Ligne",
  "description": "Roulette en Ligne est un outil gratuit pour créer des roulettes personnalisées. Concevez et partagez facilement vos roulettes originales avec des options et des probabilités sur mesure. Parfait pour les tirages au sort ou les décisions quotidiennes, sans inscription requise.",
  "excerpt": "Roulette en Ligne est un outil qui vous permet de créer et de partager facilement des roulettes personnalisées. Créez votre propre roulette originale et amusez-vous avec vos amis et votre famille.",
  "close": "Fermer",
  "loading": "Chargement...",
  "about": {
    "title": "À propos",
    "description": "Roulette en Ligne est un outil de création de roulettes personnalisées conçu pour être intuitif. Cette page présente l'objectif du site et ses cas d'usage. Nous visons à faciliter des prises de décision justes et amusantes, pour les petits choix du quotidien comme pour les grands événements.",
    "title2": "À propos de Roulette en Ligne",
    "subtitle": "Un outil de création de roulette personnalisée intuitif pour tous",
    "section1Title": "Objectif de ce site",
    "section1Content": "'Roulette en Ligne' a été développé pour fournir un outil de création de roulettes personnalisées que tout le monde peut utiliser facilement et intuitivement. Notre but est de vous aider à faire des choix équitables tout en vous amusant dans diverses situations, des petites décisions quotidiennes aux tirages au sort d'événements.",
    "section2Title": "Public Cible",
    "section2Content": "Il est destiné à un large éventail d'utilisateurs, de l'usage personnel aux fins commerciales et éducatives, comme décider d'un lieu de déjeuner avec des amis, tirer au sort des gages pour les streamers en direct, sélectionner des élèves en classe ou choisir des gagnants pour des événements en ligne.",
    "section3Content": "Nous apprécions sincèrement vos commentaires. Nous les utiliserons comme référence pour le développement futur, alors n'hésitez pas à nous contacter via la page de contact.",
    "features": {
      "title": "Caractéristiques principales",
      "customization": "Création de roulettes personnalisées avec des éléments, des ratios et des couleurs ajustables",
      "sharing": "Partage facile des roulettes par URL ou image",
      "authentication": "Sauvegarde et gestion de vos roulettes avec authentification utilisateur",
      "mypage": "Une fonction 'Ma Page' pour voir toutes vos roulettes créées",
      "templates": "Utilisation de modèles créés par d'autres utilisateurs",
      "multiLanguage": "Support multilingue (japonais, anglais, espagnol, français)"
    }
  },
  "articles": {
    "title": "Cas d'utilisation",
    "description": "Découvrez divers cas d'utilisation pour la 'Roulette en Ligne'. Des scénarios de classe à la planification d'événements et à la prise de décision quotidienne, trouvez des idées pour stimuler votre inspiration.",
    "back_to_list": "Retour à la liste des articles"
  },
  "auth": {
    "title": "Authentification Utilisateur",
    "description": "Inscrivez-vous ou connectez-vous pour profiter de toutes les fonctionnalités de Roulette en Ligne. En créant un compte, vous pouvez sauvegarder vos roulettes pour les modifier et les réutiliser à tout moment. Gérez votre collection personnelle depuis Ma Page.",
    "signUp": "S'inscrire",
    "login": "Connexion",
    "logout": "Déconnexion",
    "username": "Nom d'utilisateur",
    "usernamePlaceholder": "Nom d'affichage",
    "email": "Adresse e-mail",
    "password": "Mot de passe",
    "error": {
      "emailInvalid": "Veuillez saisir une adresse e-mail valide.",
      "passwordLength": "Le mot de passe doit comporter au moins 6 caractères."
    },
    "loginRequired": "Connexion requise",
    "loginToSave": "Vous devez être connecté pour sauvegarder votre roulette."
  },
  "contact": {
    "title": "Nous contacter",
    "description": "Pour toute suggestion, commentaire ou rapport de bogue concernant Roulette en Ligne, n'hésitez pas à nous contacter via ce formulaire. Vos retours sont précieux et nous aideront à améliorer notre service.",
    "excerpt": "Si vous avez des opinions ou des demandes, n'hésitez pas à nous contacter en utilisant le formulaire ci-dessous.",
    "name": "Nom",
    "email": "Adresse e-mail",
    "subject": "Sujet",
    "message": "Message",
    "inquiryType": {
      "title": "Type de demande",
      "placeholder": "Veuillez sélectionner le type de demande",
      "options": {
        "general": "Demande générale",
        "feedback": "Commentaires/Impressions sur le site",
        "bugReport": "Rapport de bogue",
        "collaboration": "Proposition de collaboration",
        "correction": "Demande de correction de contenu",
        "featureRequest": "Demande de fonctionnalité",
        "other": "Autre"
      }
    },
    "agreeToTerms": "J'accepte la politique de confidentialité",
    "agreeToTermsExcerpt": "Vous devez accepter la politique de confidentialité pour envoyer votre demande.",
    "submit": {
      "button": "Envoyer",
      "submit": {
        "successTitle": "Merci pour votre demande",
        "successExcerpt": "Nous avons bien reçu votre message. Nous répondons généralement dans les 2 jours ouvrables.",
        "error": "L'envoi de la demande a échoué. Veuillez réessayer plus tard.",
        "errorServer": "Une erreur de serveur inattendue est survenue.",
        "errorServerPrefix": "Une erreur de serveur est survenue. Veuillez réessayer dans un instant.",
        "errorNetwork": "Il semble y avoir un problème avec votre connexion réseau. Veuillez vérifier votre connexion et réessayer."
      },
      "error": {
        "nameLength": "Le nom doit comporter au moins 2 caractères.",
        "emailInvalid": "Veuillez saisir une adresse e-mail valide.",
        "subjectLength": "Le sujet doit comporter au moins 5 caractères.",
        "messageLength": "Le message doit comporter au moins 10 caractères.",
        "inquiryTypeRequired": "Veuillez sélectionner le type de demande.",
        "agreeToTermsRequired": "Vous devez accepter la politique de confidentialité."
      },
      "newInquiry": "Faire une nouvelle demande"
    },
    "error": {
      "nameRequired": "Le nom est requis.",
      "emailRequired": "L'adresse e-mail est requise.",
      "messageRequired": "Le message est requis."
    }
  },
  "mypage": {
    "title": "Ma Page",
    "description": "Sur Ma Page, gérez toutes les roulettes originales que vous avez créées. Modifiez, supprimez et ajustez les paramètres de confidentialité de vos roulettes sauvegardées. Accédez à vos roulettes préférées où que vous soyez. Inscription utilisateur requise.",
    "profile": "Profil",
    "savedRoulettes": "Roulettes enregistrées",
    "noRoulettes": "Vous n'avez encore créé aucune roulette.",
    "createdAt": "Créé le",
    "publicSettings": "Paramètres publics",
    "edit": "Modifier",
    "editRoulette": "Modifier la Roulette",
    "delete": "Supprimer",
    "deleteConfirmTitle": "Supprimer la Roulette",
    "deleteConfirm": "Êtes-vous sûr de vouloir supprimer cette roulette ?",
    "settingsExcerpt": " - Paramètres publics",
    "publishAsTemplate": "Publier comme modèle",
    "publishAsTemplateExcerpt": "Permettre à d'autres utilisateurs de voir et d'utiliser cette roulette.",
    "allowFork": "Autoriser les autres utilisateurs à dupliquer",
    "allowForkExcerpt": "Permettre à d'autres utilisateurs de créer une nouvelle roulette basée sur ce modèle.",
    "publishProfile": "Publier le profil",
    "publishProfileExcerpt": "Affichez votre profil en tant que créateur sur le modèle.",
    "delete_account": {
      "button": "Supprimer le Compte",
      "modal_title": "Confirmer la Suppression du Compte",
      "modal_description": "Êtes-vous sûr de vouloir supprimer votre compte ? Cette action est irréversible.",
      "confirm_button": "Supprimer",
      "cancel_button": "Annuler"
    }
  },
  "roulette": {
    "title": "Créer une Roulette",
    "description": "Créez votre propre roulette unique ! Personnalisez librement les noms des options, les couleurs et les ratios de gain. Cet outil en ligne gratuit est idéal pour divers usages comme les jeux, le choix d'un restaurant ou les tirages au sort. Partagez votre création facilement avec une URL.",
    "shareUrl": "Partager par URL",
    "shareImage": "Partager en tant qu'image",
    "settings": {
      "title": "Paramètres de la Roulette",
      "name": "Titre",
      "namePlaceholder": "Saisir le titre de la roulette",
      "excerpt": "Description",
      "excerptPlaceholder": "Saisir la description de la roulette",
      "optionDefault": "Option",
      "items": {
        "addItem": "Ajouter un élément",
        "itemPlaceholder": "Nom de l'élément"
      },
      "save": "Sauvegarder",
      "saveInProgress": "Sauvegarde en cours...",
      "share": "Partager",
      "saveChanges": "Sauvegarder les modifications"
    },
    "preview": {
      "title": "Ma Roulette",
      "spin": "Lancer",
      "spinning": "En cours..."
    },
    "result": {
      "title": "Et le résultat est... !"
    },
    "copy": {
      "success": "Copié avec succès !",
      "successMessageRoulette": "L'URL de la roulette a été copiée dans votre presse-papiers.",
      "successMessageResult": "L'URL du résultat a été copiée dans votre presse-papiers.",
      "error": "La copie de l'URL a échoué.",
      "copyLink": "Copier le lien de la Roulette",
      "confirmTitle": "Confirmer le partage",
      "confirmMessage": "Le résultat ne sera pas inclus. Cela ne partagera que les paramètres actuels de la roulette. Est-ce correct ?",
      "confirmAction": "Partager"
    }
  },
  "privacyPolicy": {
    "title": "Politique de confidentialité",
    "description": "Voici la Politique de Confidentialité de Roulette en Ligne. Elle détaille les informations que nous collectons, leur utilisation, ainsi que notre politique sur les cookies et Google Analytics. Découvrez nos engagements pour une utilisation du service en toute confiance.",
    "lastUpdated": "Dernière mise à jour : 24 juillet 2025"
  },
  "termsOfService": {
    "title": "Conditions d'utilisation",
    "description": "Cette page présente les Conditions d'Utilisation de Roulette en Ligne. Elle définit les règles d'usage, les actions interdites et les clauses de non-responsabilité. La gestion du contenu utilisateur y est aussi décrite. À lire avant toute utilisation.",
    "lastUpdated": "Dernière mise à jour : 24 juillet 2025"
  },
  "templates": {
    "template": "Modèle",
    "title": "Rechercher parmi les modèles",
    "description": "À la recherche d'idées de roulettes amusantes ? Sur notre page de Modèles, vous pouvez parcourir et utiliser des roulettes uniques créées par d'autres utilisateurs. Vous pouvez également personnaliser un modèle pour créer facilement votre propre roulette originale.",
    "subtitle": "Découvrez des roulettes uniques créées par d'autres utilisateurs et commencez à les utiliser immédiatement.",
    "like": "J'aime",
    "searchPlaceholder": "Rechercher par mot-clé...",
    "sortBy": {
      "newest": "Les plus récents",
      "popular": "Populaires"
    },
    "noResults": "Aucun modèle correspondant à vos critères n'a été trouvé.",
    "noExcerpt": "Aucune description disponible.",
    "anonymous": "Utilisateur Anonyme",
    "useTemplate": "Utiliser ce modèle",
    "official": "Modèle officiel",
    "copySuffix": " - copie",
    "forkAndSave": "Dupliquer et sauvegarder ce modèle",
    "creatorProfileTitle": "Profil du créateur"
  },
  "howToUse": {
    "title": "Comment utiliser",
    "description": "Apprenez tout, des bases de 'Roulette sur le Web' aux fonctionnalités pratiques disponibles après la création d'un compte. Maîtrisez la création et le partage de roulettes, l'utilisation de modèles et tirez le meilleur parti de notre site.",
    "basic": {
      "title": "Utilisation de Base (pour les Invités)",
      "create": "Comment créer une roulette (ajouter/supprimer des éléments, changer les ratios/couleurs)",
      "create_description": "Apprenez à créer votre propre roulette originale en définissant librement les éléments, les couleurs et les ratios.",
      "create_detail_structured": {
        "step1_title": "Step 1: Basic Roulette Settings",
        "step1_content": "First, enter the 'Title' and 'Description' for your roulette. The title helps distinguish it from other roulettes, and the description is useful for explaining its purpose. Set them up to be clear for others.",
        "step2_title": "Step 2: Adding and Customizing Items",
        "step2_content": "Next, use the 'Add Item' button to add options to the roulette. For each item, you can freely set its display 'Name' and an identifying 'Color'. You can intuitively pick colors from the color picker.",
        "step3_title": "Step 3: Setting the Winning Ratio",
        "step3_content": "You can set a 'Ratio' for each item. This is a number that indicates how likely that item is to be selected. For example, if you set 'A: 2, B: 1', A will be twice as likely to be chosen as B. If you want all items to have the same probability, enter the same number for all.",
        "step4_title": "Step 4: Finishing Setup",
        "step4_content": "Once you've configured all the items, your original roulette is complete! Check it in the preview and you can start the draw anytime with the 'Spin' button."
      },
      "spin": "Comment faire tourner la roulette",
      "spin_description": "Explique la procédure pour faire tourner la roulette créée et vérifier les résultats du tirage.",
      "spin_detail_structured": {
        "step1_title": "Step 1: Spin the Roulette",
        "step1_content": "The roulette you created and configured is displayed in the preview area. When you click the 'Spin' button in the center, the roulette will start to spin vigorously.",
        "step2_title": "Step 2: Check the Result",
        "step2_content": "When the rotation stops, the selected item is highlighted, and the result is displayed prominently in the center of the screen. A fun confetti animation will liven up the moment of the draw!",
        "step3_title": "Step 3: Try Again",
        "step3_content": "If you want to spin the roulette again with the same settings, just click the 'Spin Again' button on the result screen. You can start the next draw right away."
      },
      "share": "Comment partager les résultats (URL/Image)",
      "share_description": "Apprenez à partager les résultats de votre roulette avec des amis ou sur les réseaux sociaux via une URL ou sous forme d'image.",
      "share_detail_structured": {
        "step1_title": "Step 1: Select a Sharing Option",
        "step1_content": "After spinning the roulette, you can share it from the result screen or the 'Share' button on the settings screen. You can choose between two sharing options: 'Share via URL' and 'Share as Image'.",
        "step2_title": "Step 2: Sharing via URL",
        "step2_content": "When you select 'Share via URL', the URL of the page reflecting the current roulette settings (results not included) is copied to your clipboard. Paste this URL to friends or on social media, and anyone can experience the same roulette.",
        "step3_title": "Step 3: Sharing as an Image",
        "step3_content": "When you select 'Share as Image', the current look of the roulette is downloaded as an image file (PNG format). This is useful for announcing event results or for sharing visually."
      }
    },
    "account": {
      "title": "Fonctionnalités du Compte",
      "merit": "Avantages de l'inscription (sauvegarde des données, etc.)",
      "merit_description": "Découvrez les fonctionnalités pratiques qui deviennent disponibles lorsque vous créez un compte gratuit.",
      "merit_detail_structured": {
        "benefit1_title": "Benefit 1: Save and Reuse Roulettes",
        "benefit1_content": "When you create an account, you can save your created roulettes to 'My Page'. This saves you the trouble of recreating the same roulette every time, allowing you to call up and use your favorite settings at any time.",
        "benefit2_title": "Benefit 2: Sync Across Devices",
        "benefit2_content": "By logging in, you can access your saved roulettes from any device. For example, you can use a roulette created on your PC at home from your smartphone on the go.",
        "benefit3_title": "Benefit 3: Publish as a Template",
        "benefit3_content": "You can publish your masterpiece roulettes as 'templates' that other users can also use. Your ideas might be helpful to someone around the world. You can change the publication settings at any time."
      },
      "auth": "Étapes pour l'inscription et la connexion",
      "auth_description": "Explique comment créer un nouveau compte et les étapes pour se connecter après l'inscription.",
      "auth_detail_structured": {
        "step1_title": "Step 1: How to Sign Up",
        "step1_content": "Proceed to the account creation page from the 'Sign Up' button in the header menu. The only required information is 'Username', 'Email Address', and 'Password'. After entering, click the button to complete the registration.",
        "step2_title": "Step 2: How to Log In",
        "step2_content": "Once you have created an account, log in from the 'Login' page by entering your registered email address and password. Your login state will be maintained, so there is no need to enter it every time.",
        "step3_title": "Step 3: Social Login",
        "step3_content": "As an easier login method, we also support social login using a Google account. Just click the 'Login with Google' button to start using the service immediately without any tedious input."
      }
    },
    "loggedIn": {
      "title": "Fonctionnalités Supplémentaires Après Connexion",
      "mypage": "Ma Page : Gérez les roulettes créées (modifier/supprimer) et modifiez votre profil.",
      "mypage_description": "Explique comment gérer vos roulettes sauvegardées sur la page dédiée 'Ma Page' pour les utilisateurs connectés.",
      "mypage_detail_structured": {
        "step1_title": "Step 1: Accessing My Page",
        "step1_content": "While logged in, click on your username in the header menu or the 'My Page' link to go to your dedicated page.",
        "step2_title": "Step 2: Managing Roulettes",
        "step2_content": "On My Page, all the roulettes you have saved are displayed in a list. From here, you can change the settings with the 'Edit' button for each roulette, or delete unnecessary ones with the 'Delete' button.",
        "step3_title": "Step 3: Public Settings and Profile",
        "step3_content": "By changing the 'Public Settings' for each roulette, you can publish it as a template that other users can use. You can also set up your public profile information from 'Edit Profile' to let other users know who created the template."
      },
      "templates": "Fonctionnalité de Modèle : Comment utiliser les modèles et rendre publiques vos propres roulettes.",
      "templates_description": "Apprenez à trouver et à utiliser des modèles créés par d'autres utilisateurs, et à publier vos propres roulettes en tant que modèles.",
      "templates_detail_structured": {
        "step1_title": "Step 1: Find a Template",
        "step1_content": "On the 'Find from Templates' page, various roulettes created by other users are published. Find interesting templates by searching with keywords or sorting by newest or most popular.",
        "step2_title": "Step 2: Use a Template",
        "step2_content": "When you find a template you like, click the 'Use this Template' button. This will open a new roulette creation screen with all the settings of that template (items, colors, ratios, etc.) inherited. All you have to do is customize it freely.",
        "step3_title": "Step 3: Publish a Template",
        "step3_content": "To publish your own roulette as a template, first go to My Page. In the 'Public Settings' of the roulette you want to publish, turn on 'Publish as Template', and other users will be able to use your roulette."
      }
    },
    "advanced": {
      "title": "Advanced Features",
      "original_roulette": "How to use Original Roulette",
      "original_roulette_description": "Learn the steps to create your very own completely original roulette. Shape your ideas from scratch, without being tied to other templates.",
      "original_roulette_detail_structured": {
        "step1_title": "Step 1: Starting from Scratch",
        "step1_content": "The greatest feature of the original roulette function is the ability to create your own roulette from a completely blank state, without relying on existing templates. First, decide on a title and description for your roulette on the creation page and take the first step of your idea.",
        "step2_title": "Step 2: Freely Configure Items",
        "step2_content": "You can add as many options as you like with the 'Add Item' button. Give each item a unique name and set your favorite color with the color picker to aim for a visually fun roulette.",
        "step3_title": "Step 3: Manipulate Probability with Ratios",
        "step3_content": "By adjusting the 'Ratio' of each item, you can finely control the winning probability. Design the lottery logic as you wish, such as making a specific item more likely to win, or making all items equal.",
        "step4_title": "Step 4: Save and Share",
        "step4_content": "If you are logged into your account, you can record the completed roulette on My Page with the 'Save' button. You can also use the 'Share' function to broadcast your unique roulette to the world via URL or image."
      }
    },
    "back_to_list": "Back to How to Use list"
  },
  "footer": {
    "copyright": "Roulette en Ligne. Tous droits réservés.",
    "services": "Services",
    "howToUse": "Comment utiliser",
    "legal": "Légal",
    "social": "Social",
    "tagline": "Créez et partagez instantanément vos propres roulettes personnalisées."
  },
  "cookie": {
    "bannerText": "Ce site utilise des cookies pour améliorer l'expérience utilisateur et analyser l'utilisation du site. Cela inclut l'analyse du trafic par Google Analytics. En acceptant l'utilisation de cookies, vous nous aidez à fournir un meilleur service.",
    "seeDetails": "Voir les détails",
    "accept": "Accepter",
    "decline": "Refuser",
    "declineConfirmation": "Paramètres enregistrés. Aucune information ne sera collectée sur ce site."
  },
  "heroSection": {
    "templates": {
      "title": "Rechercher parmi les modèles",
      "excerpt": "Découvrez des roulettes uniques créées par d'autres utilisateurs et commencez à les utiliser immédiatement."
    },
    "createRoulette": {
      "title": "Créer une Roulette Originale",
      "excerpt": "Créez instantanément votre propre roulette de tirage au sort avec des éléments et des pondérations personnalisés. Aucune inscription requise. Compatible PC et smartphone."
    },
    "login": {
      "title": "Connectez-vous pour Sauvegarder vos Roulettes",
      "excerpt": "Sauvegardez vos roulettes créées et accédez-y depuis n'importe quel appareil.",
      "goToMypage": "Aller à Ma Page",
      "goToLogin": "Aller à la Connexion"
    },
    "futureFeatures": {
      "title": "Fonctionnalités Futures",
      "excerpt": "Nous prévoyons d'ajouter des fonctionnalités plus pratiques telles qu'une fonction de connexion, une page utilisateur et une galerie de modèles."
    },
    "contact": {
      "title": "Nous contacter",
      "excerpt": "N'hésitez pas à nous envoyer vos opinions, commentaires ou rapports de bogues."
    },
    "language": {
      "title": "Support Multilingue",
      "excerpt": "Ce site prend en charge le japonais, l'anglais, l'espagnol et le français. Vous pouvez changer de langue à tout moment depuis le sélecteur de langue dans le menu."
    }
  }
}