{
  "title": "Ruleta Web",
  "description": "Ruleta Web es una herramienta gratuita en línea para crear ruletas personalizadas. Diseña y comparte fácilmente tus ruletas originales con elementos y probabilidades a tu gusto. Ideal para sorteos en eventos o decisiones diarias, y no requiere registro.",
  "excerpt": "Ruleta Web es una herramienta que te permite crear y compartir fácilmente ruletas personalizadas. Crea tu propia ruleta original y diviértete con amigos y familiares.",
  "close": "Cerrar",
  "loading": "Cargando...",
  "about": {
    "title": "Acerca de",
    "description": "Ruleta Web es una herramienta de creación de ruletas personalizadas diseñada para un uso intuitivo. Esta página presenta el propósito del desarrollo del sitio y sus posibles usos. Nuestro objetivo es apoyar la toma de decisiones justas y divertidas en cualquier ocasión.",
    "title2": "Acerca de Ruleta Web",
    "subtitle": "Una herramienta intuitiva de creación de ruletas personalizadas para todos",
    "section1Title": "Propósito de este sitio",
    "section1Content": "'Ruleta Web' fue desarrollado para proporcionar una herramienta de creación de ruletas personalizadas que cualquiera puede usar de manera fácil e intuitiva. Nuestro objetivo es ayudarte a tomar decisiones justas mientras te diviertes en diversas situaciones, desde pequeñas decisiones diarias hasta sorteos de eventos.",
    "section2Title": "Público objetivo",
    "section2Content": "Está destinado a una amplia gama de usuarios, desde uso personal hasta fines comerciales y educativos, como decidir un lugar para almorzar con amigos, sortear castigos para streamers en vivo, seleccionar estudiantes en el aula o elegir ganadores para eventos en línea.",
    "section3Content": "Agradecemos sinceramente tus comentarios. Los utilizaremos como referencia para futuros desarrollos, así que no dudes en contactarnos a través de la página de contacto.",
    "features": {
      "title": "Principales características",
      "customization": "Creación de ruletas personalizadas con elementos, proporciones y colores configurables",
      "sharing": "Compartir fácilmente ruletas por URL o imagen",
      "authentication": "Guardar y gestionar tus ruletas con autenticación de usuario",
      "mypage": "Una función de 'Mi Página' para ver todas tus ruletas creadas",
      "templates": "Uso de plantillas creadas por otros usuarios",
      "multiLanguage": "Soporte multilingüe (japonés, inglés, español, francés)"
    }
  },
  "auth": {
    "title": "Autenticación de Usuario",
    "description": "Regístrate o inicia sesión para acceder a todas las funciones de Ruleta Web. Al crear una cuenta, puedes guardar tus ruletas para editarlas y reutilizarlas cuando quieras. Gestiona tu colección personal de ruletas en tu propia Mi Página.",
    "signUp": "Registrarse",
    "login": "Iniciar sesión",
    "logout": "Cerrar sesión",
    "username": "Nombre de usuario",
    "usernamePlaceholder": "Nombre a mostrar",
    "email": "Dirección de correo electrónico",
    "password": "Contraseña",
    "error": {
      "emailInvalid": "Por favor, introduce una dirección de correo electrónico válida.",
      "passwordLength": "La contraseña debe tener al menos 6 caracteres."
    },
    "loginRequired": "Se requiere iniciar sesión",
    "loginToSave": "Necesitas iniciar sesión para guardar tu ruleta."
  },
  "contact": {
    "title": "Contacto",
    "description": "Si tienes comentarios, sugerencias o quieres informar de un error sobre Ruleta Web, no dudes en contactarnos a través de este formulario. Valoramos tus opiniones y las utilizaremos para mejorar nuestro servicio.",
    "excerpt": "Si tienes alguna opinión o solicitud, no dudes en contactarnos utilizando el siguiente formulario.",
    "name": "Nombre",
    "email": "Dirección de correo electrónico",
    "subject": "Asunto",
    "message": "Mensaje",
    "inquiryType": {
      "title": "Tipo de consulta",
      "placeholder": "Por favor, selecciona el tipo de consulta",
      "options": {
        "general": "Consulta general",
        "feedback": "Comentarios/Impresiones sobre el sitio",
        "bugReport": "Informe de error",
        "collaboration": "Propuesta de colaboración",
        "correction": "Solicitud de corrección de contenido",
        "featureRequest": "Solicitud de función",
        "other": "Otro"
      }
    },
    "agreeToTerms": "Acepto la Política de Privacidad",
    "agreeToTermsExcerpt": "Debes aceptar la Política de Privacidad para enviar tu consulta.",
    "submit": {
      "button": "Enviar",
      "submit": {
        "successTitle": "Gracias por tu consulta",
        "successExcerpt": "Hemos recibido tu mensaje. Normalmente responderemos en un plazo de 2 días hábiles.",
        "error": "Error al enviar la consulta. Por favor, inténtalo de nuevo más tarde.",
        "errorServer": "Ocurrió un error inesperado en el servidor.",
        "errorServerPrefix": "Ocurrió un error en el servidor. Por favor, inténtalo de nuevo en un momento.",
        "errorNetwork": "Parece que hay un problema con tu conexión de red. Por favor, comprueba tu conexión e inténtalo de nuevo."
      },
      "error": {
        "nameLength": "El nombre debe tener al menos 2 caracteres.",
        "emailInvalid": "Por favor, introduce una dirección de correo electrónico válida.",
        "subjectLength": "El asunto debe tener al menos 5 caracteres.",
        "messageLength": "El mensaje debe tener al menos 10 caracteres.",
        "inquiryTypeRequired": "Por favor, selecciona el tipo de consulta.",
        "agreeToTermsRequired": "Debes aceptar la Política de Privacidad."
      },
      "newInquiry": "Hacer una nueva consulta"
    },
    "error": {
      "nameRequired": "El nombre es obligatorio.",
      "emailRequired": "La dirección de correo electrónico es obligatoria.",
      "messageRequired": "El mensaje es obligatorio."
    }
  },
  "mypage": {
    "title": "Mi Página",
    "description": "En Mi Página, puedes gestionar todas las ruletas originales que has creado. Edita, elimina y cambia la configuración de privacidad de tus ruletas guardadas de forma sencilla. Accede y disfruta de tus ruletas favoritas en cualquier momento. Se requiere registro de usuario.",
    "profile": "Perfil",
    "savedRoulettes": "Ruletas guardadas",
    "noRoulettes": "Aún no has creado ninguna ruleta.",
    "createdAt": "Fecha de creación",
    "publicSettings": "Configuración pública",
    "edit": "Editar",
    "editRoulette": "Editar Ruleta",
    "delete": "Eliminar",
    "deleteConfirmTitle": "Eliminar Ruleta",
    "deleteConfirm": "¿Estás seguro de que quieres eliminar esta ruleta?",
    "settingsExcerpt": " - Configuración pública",
    "publishAsTemplate": "Publicar como plantilla",
    "publishAsTemplateExcerpt": "Permitir que otros usuarios vean y usen esta ruleta.",
    "allowFork": "Permitir que otros usuarios dupliquen",
    "allowForkExcerpt": "Permitir que otros usuarios creen una nueva ruleta basada en esta plantilla.",
    "publishProfile": "Publicar perfil",
    "publishProfileExcerpt": "Muestra tu perfil como el creador en la plantilla."
  },
  "roulette": {
    "title": "Crear Ruleta",
    "description": "¡Crea tu propia ruleta personalizada! Modifica libremente los nombres de los elementos, los colores y las probabilidades de ganar. Es la herramienta en línea gratuita perfecta para juegos, decidir dónde comer o sorteos en eventos. ¡Comparte tu ruleta con un simple URL!",
    "shareUrl": "Compartir por URL",
    "shareImage": "Compartir como imagen",
    "settings": {
      "title": "Configuración de la Ruleta",
      "name": "Título",
      "namePlaceholder": "Introduce el título de la ruleta",
      "excerpt": "Descripción",
      "excerptPlaceholder": "Introduce la descripción de la ruleta",
      "optionDefault": "Opción",
      "items": {
        "addItem": "Añadir elemento",
        "itemPlaceholder": "Nombre del elemento"
      },
      "save": "Guardar",
      "saveInProgress": "Guardando...",
      "share": "Compartir",
      "saveChanges": "Guardar cambios"
    },
    "preview": {
      "title": "Mi Ruleta",
      "spin": "Girar",
      "spinning": "Girando..."
    },
    "result": {
      "title": "¡Y el resultado es...!"
    },
    "copy": {
      "success": "¡Copiado con éxito!",
      "successMessageRoulette": "La URL de la ruleta ha sido copiada a tu portapapeles.",
      "successMessageResult": "La URL del resultado ha sido copiada a tu portapapeles.",
      "error": "Error al copiar la URL.",
      "copyLink": "Copiar enlace de la Ruleta",
      "confirmTitle": "Confirmar compartir",
      "confirmMessage": "El resultado no será incluido. Esto solo compartirá la configuración actual de la ruleta. ¿Está bien?",
      "confirmAction": "Compartir"
    }
  },
  "privacyPolicy": {
    "title": "Política de Privacidad",
    "description": "Esta es la página de la Política de Privacidad de Ruleta Web. Aquí se detalla el tipo de información que recopilamos, cómo la usamos y nuestro uso de cookies y Google Analytics. Revisa nuestro compromiso para que uses el servicio con total confianza.",
    "lastUpdated": "Última actualización: 24 de julio de 2025"
  },
  "termsOfService": {
    "title": "Términos de Servicio",
    "description": "Esta página contiene los Términos de Servicio de Ruleta Web. Define las reglas de uso, las acciones prohibidas y las cláusulas de exención de responsabilidad. También describe cómo se gestiona el contenido generado por los usuarios. Léelo antes de usar el servicio.",
    "lastUpdated": "Última actualización: 24 de julio de 2025"
  },
  "templates": {
    "template": "Plantilla",
    "title": "Buscar desde Plantillas",
    "description": "¿Buscas ideas divertidas para una ruleta? En nuestra página de Plantillas, puedes explorar y utilizar ruletas únicas creadas por otros usuarios. También puedes personalizar fácilmente una plantilla para crear tu propia ruleta original.",
    "subtitle": "Descubre ruletas únicas creadas por otros usuarios y empieza a usarlas de inmediato.",
    "like": "Me gusta",
    "searchPlaceholder": "Buscar por palabra clave...",
    "sortBy": {
      "newest": "Más nuevos",
      "popular": "Populares"
    },
    "noResults": "No se encontraron plantillas que coincidan con tus criterios.",
    "noExcerpt": "No hay descripción disponible.",
    "anonymous": "Usuario Anónimo",
    "useTemplate": "Usar esta Plantilla",
    "copySuffix": " - copia",
    "forkAndSave": "Duplicar y Guardar esta Plantilla",
    "creatorProfileTitle": "Perfil del creador"
  },
  "howToUse": {
    "title": "Cómo usar",
    "description": "Aprende todo, desde lo básico de 'Ruleta en la Web' hasta las funciones convenientes disponibles después de registrar una cuenta. Domina cómo crear y compartir ruletas, usar plantillas y aprovechar al máximo nuestro sitio.",
    "basic": {
      "title": "Uso Básico (para Invitados)",
      "create": "Cómo crear una ruleta (agregar/eliminar elementos, cambiar proporciones/colores)",
      "spin": "Cómo girar la ruleta",
      "share": "Cómo compartir resultados (URL/Imagen)"
    },
    "account": {
      "title": "Funciones de la Cuenta",
      "merit": "Beneficios del registro de cuenta (guardado de datos, etc.)",
      "auth": "Pasos para nuevo registro e inicio de sesión"
    },
    "loggedIn": {
      "title": "Funciones Adicionales Después de Iniciar Sesión",
      "mypage": "Mi Página: Gestiona las ruletas creadas (editar/eliminar) y edita tu perfil.",
      "templates": "Función de Plantilla: Cómo usar plantillas y hacer públicas tus propias ruletas."
    }
  },
  "footer": {
    "copyright": "Ruleta Web. Todos los derechos reservados.",
    "services": "Servicios",
    "howToUse": "Cómo usar",
    "legal": "Legal",
    "social": "Social",
    "tagline": "Crea y comparte instantáneamente tus propias ruletas personalizadas."
  },
  "cookie": {
    "bannerText": "Este sitio utiliza cookies para mejorar la experiencia del usuario y analizar el uso del sitio. Esto incluye el análisis de tráfico por parte de Google Analytics. Al aceptar el uso de cookies, nos ayudas a proporcionar un mejor servicio.",
    "seeDetails": "Ver detalles",
    "accept": "Aceptar",
    "decline": "Rechazar",
    "declineConfirmation": "Configuración guardada. No se recopilará información en este sitio."
  },
  "heroSection": {
    "templates": {
      "title": "Buscar desde Plantillas",
      "excerpt": "Descubre ruletas únicas creadas por otros usuarios y empieza a usarlas de inmediato."
    },
    "createRoulette": {
      "title": "Crea una Ruleta Original",
      "excerpt": "Crea instantáneamente tu propia ruleta de sorteo con elementos y pesos personalizados. No se requiere registro. Compatible con PC y smartphone."
    },
    "login": {
      "title": "Inicia sesión para Guardar tus Ruletas",
      "excerpt": "Guarda las ruletas que has creado y accede a ellas desde cualquier dispositivo.",
      "goToMypage": "Ir a Mi Página",
      "goToLogin": "Ir a Iniciar Sesión"
    },
    "futureFeatures": {
      "title": "Futuras Funciones",
      "excerpt": "Planeamos añadir funciones más convenientes como una función de inicio de sesión, una página de usuario y una galería de plantillas."
    },
    "contact": {
      "title": "Contacto",
      "excerpt": "No dudes en enviarnos tus opiniones, comentarios o informes de errores."
    },
    "language": {
      "title": "Soporte Multilingüe",
      "excerpt": "Este sitio es compatible con japonés, inglés, español y francés. Puedes cambiar el idioma en cualquier momento desde el selector de idioma en el menú."
    }
  }
}
