{
  "title": "Ruleta Web",
  "description": "Ruleta Web es una herramienta gratuita en línea para crear ruletas personalizadas. Diseña y comparte fácilmente tus ruletas originales con elementos y probabilidades a tu gusto. Ideal para sorteos en eventos o decisiones diarias, y no requiere registro.",
  "excerpt": "Ruleta Web es una herramienta que te permite crear y compartir fácilmente ruletas personalizadas. Crea tu propia ruleta original y diviértete con amigos y familiares.",
  "close": "Cerrar",
  "loading": "Cargando...",
  "about": {
    "title": "Acerca de",
    "description": "Ruleta Web es una herramienta de creación de ruletas personalizadas diseñada para un uso intuitivo. Esta página presenta el propósito del desarrollo del sitio y sus posibles usos. Nuestro objetivo es apoyar la toma de decisiones justas y divertidas en cualquier ocasión.",
    "title2": "Acerca de Ruleta Web",
    "subtitle": "Una herramienta intuitiva de creación de ruletas personalizadas para todos",
    "section1Title": "Propósito de este sitio",
    "section1Content": "'Ruleta Web' fue desarrollado para proporcionar una herramienta de creación de ruletas personalizadas que cualquiera puede usar de manera fácil e intuitiva. Nuestro objetivo es ayudarte a tomar decisiones justas mientras te diviertes en diversas situaciones, desde pequeñas decisiones diarias hasta sorteos de eventos.",
    "section2Title": "Público objetivo",
    "section2Content": "Está destinado a una amplia gama de usuarios, desde uso personal hasta fines comerciales y educativos, como decidir un lugar para almorzar con amigos, sortear castigos para streamers en vivo, seleccionar estudiantes en el aula o elegir ganadores para eventos en línea.",
    "section3Content": "Agradecemos sinceramente tus comentarios. Los utilizaremos como referencia para futuros desarrollos, así que no dudes en contactarnos a través de la página de contacto.",
    "features": {
      "title": "Principales características",
      "customization": "Creación de ruletas personalizadas con elementos, proporciones y colores configurables",
      "sharing": "Compartir fácilmente ruletas por URL o imagen",
      "authentication": "Guardar y gestionar tus ruletas con autenticación de usuario",
      "mypage": "Una función de 'Mi Página' para ver todas tus ruletas creadas",
      "templates": "Uso de plantillas creadas por otros usuarios",
      "multiLanguage": "Soporte multilingüe (japonés, inglés, español, francés)"
    }
  },
  "articles": {
    "title": "Casos de Uso",
    "description": "Descubre varios casos de uso para la 'Ruleta Web'. Desde escenarios en el aula hasta la planificación de eventos y la toma de decisiones diarias, encuentra ideas para despertar tu inspiración."
  },
  "auth": {
    "title": "Autenticación de Usuario",
    "description": "Regístrate o inicia sesión para acceder a todas las funciones de Ruleta Web. Al crear una cuenta, puedes guardar tus ruletas para editarlas y reutilizarlas cuando quieras. Gestiona tu colección personal de ruletas en tu propia Mi Página.",
    "signUp": "Registrarse",
    "login": "Iniciar sesión",
    "logout": "Cerrar sesión",
    "username": "Nombre de usuario",
    "usernamePlaceholder": "Nombre a mostrar",
    "email": "Dirección de correo electrónico",
    "password": "Contraseña",
    "error": {
      "emailInvalid": "Por favor, introduce una dirección de correo electrónico válida.",
      "passwordLength": "La contraseña debe tener al menos 6 caracteres."
    },
    "loginRequired": "Se requiere iniciar sesión",
    "loginToSave": "Necesitas iniciar sesión para guardar tu ruleta."
  },
  "contact": {
    "title": "Contacto",
    "description": "Si tienes comentarios, sugerencias o quieres informar de un error sobre Ruleta Web, no dudes en contactarnos a través de este formulario. Valoramos tus opiniones y las utilizaremos para mejorar nuestro servicio.",
    "excerpt": "Si tienes alguna opinión o solicitud, no dudes en contactarnos utilizando el siguiente formulario.",
    "name": "Nombre",
    "email": "Dirección de correo electrónico",
    "subject": "Asunto",
    "message": "Mensaje",
    "inquiryType": {
      "title": "Tipo de consulta",
      "placeholder": "Por favor, selecciona el tipo de consulta",
      "options": {
        "general": "Consulta general",
        "feedback": "Comentarios/Impresiones sobre el sitio",
        "bugReport": "Informe de error",
        "collaboration": "Propuesta de colaboración",
        "correction": "Solicitud de corrección de contenido",
        "featureRequest": "Solicitud de función",
        "other": "Otro"
      }
    },
    "agreeToTerms": "Acepto la Política de Privacidad",
    "agreeToTermsExcerpt": "Debes aceptar la Política de Privacidad para enviar tu consulta.",
    "submit": {
      "button": "Enviar",
      "submit": {
        "successTitle": "Gracias por tu consulta",
        "successExcerpt": "Hemos recibido tu mensaje. Normalmente responderemos en un plazo de 2 días hábiles.",
        "error": "Error al enviar la consulta. Por favor, inténtalo de nuevo más tarde.",
        "errorServer": "Ocurrió un error inesperado en el servidor.",
        "errorServerPrefix": "Ocurrió un error en el servidor. Por favor, inténtalo de nuevo en un momento.",
        "errorNetwork": "Parece que hay un problema con tu conexión de red. Por favor, comprueba tu conexión e inténtalo de nuevo."
      },
      "error": {
        "nameLength": "El nombre debe tener al menos 2 caracteres.",
        "emailInvalid": "Por favor, introduce una dirección de correo electrónico válida.",
        "subjectLength": "El asunto debe tener al menos 5 caracteres.",
        "messageLength": "El mensaje debe tener al menos 10 caracteres.",
        "inquiryTypeRequired": "Por favor, selecciona el tipo de consulta.",
        "agreeToTermsRequired": "Debes aceptar la Política de Privacidad."
      },
      "newInquiry": "Hacer una nueva consulta"
    },
    "error": {
      "nameRequired": "El nombre es obligatorio.",
      "emailRequired": "La dirección de correo electrónico es obligatoria.",
      "messageRequired": "El mensaje es obligatorio."
    }
  },
  "mypage": {
    "title": "Mi Página",
    "description": "En Mi Página, puedes gestionar todas las ruletas originales que has creado. Edita, elimina y cambia la configuración de privacidad de tus ruletas guardadas de forma sencilla. Accede y disfruta de tus ruletas favoritas en cualquier momento. Se requiere registro de usuario.",
    "profile": "Perfil",
    "savedRoulettes": "Ruletas guardadas",
    "noRoulettes": "Aún no has creado ninguna ruleta.",
    "createdAt": "Fecha de creación",
    "publicSettings": "Configuración pública",
    "edit": "Editar",
    "editRoulette": "Editar Ruleta",
    "delete": "Eliminar",
    "deleteConfirmTitle": "Eliminar Ruleta",
    "deleteConfirm": "¿Estás seguro de que quieres eliminar esta ruleta?",
    "settingsExcerpt": " - Configuración pública",
    "publishAsTemplate": "Publicar como plantilla",
    "publishAsTemplateExcerpt": "Permitir que otros usuarios vean y usen esta ruleta.",
    "allowFork": "Permitir que otros usuarios dupliquen",
    "allowForkExcerpt": "Permitir que otros usuarios creen una nueva ruleta basada en esta plantilla.",
    "publishProfile": "Publicar perfil",
    "publishProfileExcerpt": "Muestra tu perfil como el creador en la plantilla.",
    "delete_account": {
      "button": "Eliminar Cuenta",
      "modal_title": "Confirmar Eliminación de Cuenta",
      "modal_description": "¿Estás seguro de que quieres eliminar tu cuenta? Esta acción no se puede deshacer.",
      "confirm_button": "Eliminar",
      "cancel_button": "Cancelar"
    }
  },
  "roulette": {
    "title": "Crear Ruleta",
    "description": "¡Crea tu propia ruleta personalizada! Modifica libremente los nombres de los elementos, los colores y las probabilidades de ganar. Es la herramienta en línea gratuita perfecta para juegos, decidir dónde comer o sorteos en eventos. ¡Comparte tu ruleta con un simple URL!",
    "shareUrl": "Compartir por URL",
    "shareImage": "Compartir como imagen",
    "settings": {
      "title": "Configuración de la Ruleta",
      "name": "Título",
      "namePlaceholder": "Introduce el título de la ruleta",
      "excerpt": "Descripción",
      "excerptPlaceholder": "Introduce la descripción de la ruleta",
      "optionDefault": "Opción",
      "items": {
        "addItem": "Añadir elemento",
        "itemPlaceholder": "Nombre del elemento"
      },
      "save": "Guardar",
      "saveInProgress": "Guardando...",
      "share": "Compartir",
      "saveChanges": "Guardar cambios"
    },
    "preview": {
      "title": "Mi Ruleta",
      "spin": "Girar",
      "spinning": "Girando..."
    },
    "result": {
      "title": "¡Y el resultado es...!"
    },
    "copy": {
      "success": "¡Copiado con éxito!",
      "successMessageRoulette": "La URL de la ruleta ha sido copiada a tu portapapeles.",
      "successMessageResult": "La URL del resultado ha sido copiada a tu portapapeles.",
      "error": "Error al copiar la URL.",
      "copyLink": "Copiar enlace de la Ruleta",
      "confirmTitle": "Confirmar compartir",
      "confirmMessage": "El resultado no será incluido. Esto solo compartirá la configuración actual de la ruleta. ¿Está bien?",
      "confirmAction": "Compartir"
    }
  },
  "privacyPolicy": {
    "title": "Política de Privacidad",
    "description": "Esta es la página de la Política de Privacidad de Ruleta Web. Aquí se detalla el tipo de información que recopilamos, cómo la usamos y nuestro uso de cookies y Google Analytics. Revisa nuestro compromiso para que uses el servicio con total confianza.",
    "lastUpdated": "Última actualización: 24 de julio de 2025"
  },
  "termsOfService": {
    "title": "Términos de Servicio",
    "description": "Esta página contiene los Términos de Servicio de Ruleta Web. Define las reglas de uso, las acciones prohibidas y las cláusulas de exención de responsabilidad. También describe cómo se gestiona el contenido generado por los usuarios. Léelo antes de usar el servicio.",
    "lastUpdated": "Última actualización: 24 de julio de 2025"
  },
  "templates": {
    "template": "Plantilla",
    "title": "Buscar desde Plantillas",
    "description": "¿Buscas ideas divertidas para una ruleta? En nuestra página de Plantillas, puedes explorar y utilizar ruletas únicas creadas por otros usuarios. También puedes personalizar fácilmente una plantilla para crear tu propia ruleta original.",
    "subtitle": "Descubre ruletas únicas creadas por otros usuarios y empieza a usarlas de inmediato.",
    "like": "Me gusta",
    "searchPlaceholder": "Buscar por palabra clave...",
    "sortBy": {
      "newest": "Más nuevos",
      "popular": "Populares"
    },
    "noResults": "No se encontraron plantillas que coincidan con tus criterios.",
    "noExcerpt": "No hay descripción disponible.",
    "anonymous": "Usuario Anónimo",
    "useTemplate": "Usar esta Plantilla",
    "official": "Plantilla oficial",
    "copySuffix": " - copia",
    "forkAndSave": "Duplicar y Guardar esta Plantilla",
    "creatorProfileTitle": "Perfil del creador"
  },
  "howToUse": {
    "title": "Cómo usar",
    "description": "Aprende todo, desde lo básico de 'Ruleta en la Web' hasta las funciones convenientes disponibles después de registrar una cuenta. Domina cómo crear y compartir ruletas, usar plantillas y aprovechar al máximo nuestro sitio.",
    "basic": {
      "title": "Uso Básico (para Invitados)",
      "create": "Cómo crear una ruleta (agregar/eliminar elementos, cambiar proporciones/colores)",
      "create_description": "Aprende a crear tu propia ruleta original configurando libremente los elementos, los colores y las proporciones.",
      "create_detail_structured": {
        "step1_title": "Step 1: Basic Roulette Settings",
        "step1_content": "First, enter the 'Title' and 'Description' for your roulette. The title helps distinguish it from other roulettes, and the description is useful for explaining its purpose. Set them up to be clear for others.",
        "step2_title": "Step 2: Adding and Customizing Items",
        "step2_content": "Next, use the 'Add Item' button to add options to the roulette. For each item, you can freely set its display 'Name' and an identifying 'Color'. You can intuitively pick colors from the color picker.",
        "step3_title": "Step 3: Setting the Winning Ratio",
        "step3_content": "You can set a 'Ratio' for each item. This is a number that indicates how likely that item is to be selected. For example, if you set 'A: 2, B: 1', A will be twice as likely to be chosen as B. If you want all items to have the same probability, enter the same number for all.",
        "step4_title": "Step 4: Finishing Setup",
        "step4_content": "Once you've configured all the items, your original roulette is complete! Check it in the preview and you can start the draw anytime with the 'Spin' button."
      },
      "spin": "Cómo girar la ruleta",
      "spin_description": "Explica el procedimiento para girar la ruleta creada y comprobar los resultados del sorteo.",
      "spin_detail_structured": {
        "step1_title": "Step 1: Spin the Roulette",
        "step1_content": "The roulette you created and configured is displayed in the preview area. When you click the 'Spin' button in the center, the roulette will start to spin vigorously.",
        "step2_title": "Step 2: Check the Result",
        "step2_content": "When the rotation stops, the selected item is highlighted, and the result is displayed prominently in the center of the screen. A fun confetti animation will liven up the moment of the draw!",
        "step3_title": "Step 3: Try Again",
        "step3_content": "If you want to spin the roulette again with the same settings, just click the 'Spin Again' button on the result screen. You can start the next draw right away."
      },
      "share": "Cómo compartir resultados (URL/Imagen)",
      "share_description": "Aprende a compartir los resultados de tu ruleta con amigos o en redes sociales a través de una URL o como una imagen.",
      "share_detail_structured": {
        "step1_title": "Step 1: Select a Sharing Option",
        "step1_content": "After spinning the roulette, you can share it from the result screen or the 'Share' button on the settings screen. You can choose between two sharing options: 'Share via URL' and 'Share as Image'.",
        "step2_title": "Step 2: Sharing via URL",
        "step2_content": "When you select 'Share via URL', the URL of the page reflecting the current roulette settings (results not included) is copied to your clipboard. Paste this URL to friends or on social media, and anyone can experience the same roulette.",
        "step3_title": "Step 3: Sharing as an Image",
        "step3_content": "When you select 'Share as Image', the current look of the roulette is downloaded as an image file (PNG format). This is useful for announcing event results or for sharing visually."
      }
    },
    "account": {
      "title": "Funciones de la Cuenta",
      "merit": "Beneficios del registro de cuenta (guardado de datos, etc.)",
      "merit_description": "Descubre las funciones convenientes que se habilitan al registrarte para obtener una cuenta gratuita.",
      "merit_detail_structured": {
        "benefit1_title": "Benefit 1: Save and Reuse Roulettes",
        "benefit1_content": "When you create an account, you can save your created roulettes to 'My Page'. This saves you the trouble of recreating the same roulette every time, allowing you to call up and use your favorite settings at any time.",
        "benefit2_title": "Benefit 2: Sync Across Devices",
        "benefit2_content": "By logging in, you can access your saved roulettes from any device. For example, you can use a roulette created on your PC at home from your smartphone on the go.",
        "benefit3_title": "Benefit 3: Publish as a Template",
        "benefit3_content": "You can publish your masterpiece roulettes as 'templates' that other users can also use. Your ideas might be helpful to someone around the world. You can change the publication settings at any time."
      },
      "auth": "Pasos para nuevo registro e inicio de sesión",
      "auth_description": "Explica cómo crear una nueva cuenta y los pasos para iniciar sesión después del registro.",
      "auth_detail_structured": {
        "step1_title": "Step 1: How to Sign Up",
        "step1_content": "Proceed to the account creation page from the 'Sign Up' button in the header menu. The only required information is 'Username', 'Email Address', and 'Password'. After entering, click the button to complete the registration.",
        "step2_title": "Step 2: How to Log In",
        "step2_content": "Once you have created an account, log in from the 'Login' page by entering your registered email address and password. Your login state will be maintained, so there is no need to enter it every time.",
        "step3_title": "Step 3: Social Login",
        "step3_content": "As an easier login method, we also support social login using a Google account. Just click the 'Login with Google' button to start using the service immediately without any tedious input."
      }
    },
    "loggedIn": {
      "title": "Funciones Adicionales Después de Iniciar Sesión",
      "mypage": "Mi Página: Gestiona las ruletas creadas (editar/eliminar) y edita tu perfil.",
      "mypage_description": "Explica cómo gestionar tus ruletas guardadas en la página dedicada 'Mi Página' para usuarios que han iniciado sesión.",
      "mypage_detail_structured": {
        "step1_title": "Step 1: Accessing My Page",
        "step1_content": "While logged in, click on your username in the header menu or the 'My Page' link to go to your dedicated page.",
        "step2_title": "Step 2: Managing Roulettes",
        "step2_content": "On My Page, all the roulettes you have saved are displayed in a list. From here, you can change the settings with the 'Edit' button for each roulette, or delete unnecessary ones with the 'Delete' button.",
        "step3_title": "Step 3: Public Settings and Profile",
        "step3_content": "By changing the 'Public Settings' for each roulette, you can publish it as a template that other users can use. You can also set up your public profile information from 'Edit Profile' to let other users know who created the template."
      },
      "templates": "Función de Plantilla: Cómo usar plantillas y hacer públicas tus propias ruletas.",
      "templates_description": "Aprende a encontrar y utilizar plantillas creadas por otros usuarios, y a publicar tus propias ruletas como plantillas.",
      "templates_detail_structured": {
        "step1_title": "Step 1: Find a Template",
        "step1_content": "On the 'Find from Templates' page, various roulettes created by other users are published. Find interesting templates by searching with keywords or sorting by newest or most popular.",
        "step2_title": "Step 2: Use a Template",
        "step2_content": "When you find a template you like, click the 'Use this Template' button. This will open a new roulette creation screen with all the settings of that template (items, colors, ratios, etc.) inherited. All you have to do is customize it freely.",
        "step3_title": "Step 3: Publish a Template",
        "step3_content": "To publish your own roulette as a template, first go to My Page. In the 'Public Settings' of the roulette you want to publish, turn on 'Publish as Template', and other users will be able to use your roulette."
      }
    },
    "advanced": {
      "title": "Advanced Features",
      "original_roulette": "How to use Original Roulette",
      "original_roulette_description": "Learn the steps to create your very own completely original roulette. Shape your ideas from scratch, without being tied to other templates.",
      "original_roulette_detail_structured": {
        "step1_title": "Step 1: Starting from Scratch",
        "step1_content": "The greatest feature of the original roulette function is the ability to create your own roulette from a completely blank state, without relying on existing templates. First, decide on a title and description for your roulette on the creation page and take the first step of your idea.",
        "step2_title": "Step 2: Freely Configure Items",
        "step2_content": "You can add as many options as you like with the 'Add Item' button. Give each item a unique name and set your favorite color with the color picker to aim for a visually fun roulette.",
        "step3_title": "Step 3: Manipulate Probability with Ratios",
        "step3_content": "By adjusting the 'Ratio' of each item, you can finely control the winning probability. Design the lottery logic as you wish, such as making a specific item more likely to win, or making all items equal.",
        "step4_title": "Step 4: Save and Share",
        "step4_content": "If you are logged into your account, you can record the completed roulette on My Page with the 'Save' button. You can also use the 'Share' function to broadcast your unique roulette to the world via URL or image."
      }
    },
    "back_to_list": "Back to How to Use list"
  },
  "footer": {
    "copyright": "Ruleta Web. Todos los derechos reservados.",
    "services": "Servicios",
    "howToUse": "Cómo usar",
    "legal": "Legal",
    "social": "Social",
    "tagline": "Crea y comparte instantáneamente tus propias ruletas personalizadas."
  },
  "cookie": {
    "bannerText": "Este sitio utiliza cookies para mejorar la experiencia del usuario y analizar el uso del sitio. Esto incluye el análisis de tráfico por parte de Google Analytics. Al aceptar el uso de cookies, nos ayudas a proporcionar un mejor servicio.",
    "seeDetails": "Ver detalles",
    "accept": "Aceptar",
    "decline": "Rechazar",
    "declineConfirmation": "Configuración guardada. No se recopilará información en este sitio."
  },
  "heroSection": {
    "templates": {
      "title": "Buscar desde Plantillas",
      "excerpt": "Descubre ruletas únicas creadas por otros usuarios y empieza a usarlas de inmediato."
    },
    "createRoulette": {
      "title": "Crea una Ruleta Original",
      "excerpt": "Crea instantáneamente tu propia ruleta de sorteo con elementos y pesos personalizados. No se requiere registro. Compatible con PC y smartphone."
    },
    "login": {
      "title": "Inicia sesión para Guardar tus Ruletas",
      "excerpt": "Guarda las ruletas que has creado y accede a ellas desde cualquier dispositivo.",
      "goToMypage": "Ir a Mi Página",
      "goToLogin": "Ir a Iniciar Sesión"
    },
    "futureFeatures": {
      "title": "Futuras Funciones",
      "excerpt": "Planeamos añadir funciones más convenientes como una función de inicio de sesión, una página de usuario y una galería de plantillas."
    },
    "contact": {
      "title": "Contacto",
      "excerpt": "No dudes en enviarnos tus opiniones, comentarios o informes de errores."
    },
    "language": {
      "title": "Soporte Multilingüe",
      "excerpt": "Este sitio es compatible con japonés, inglés, español y francés. Puedes cambiar el idioma en cualquier momento desde el selector de idioma en el menú."
    }
  }
}
